ChartsOfCharacteristicTypes/ЛБ_НастройкиЛомбард.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ЛБ_НастройкиЛомбард</Name>
			<Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:EnumRef.ЛБ_ПечатныеФормыКарточкиКлиента</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>10</v8:Digits>
					<v8:FractionDigits>0</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>10</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ЛБ_НастройкиЛомбард</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеВСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ЛБ_НастройкиЛомбард</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

ChartsOfCharacteristicTypes/ЛБ_НастройкиЛомбард/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьОграничениеТипа();
	УстановитьВидимостьДоступность(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияПриИзменении(Элемент)
	УстановитьОграничениеТипа();
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеВСпискеПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ЗначениеВСписке Тогда
	    Объект.Значение = Неопределено;
	Иначе	
	    Объект.СписокЗначений.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.СписокЗначений.Видимость 	= Объект.ЗначениеВСписке;
	Элементы.Значение.Видимость 		= Не Объект.ЗначениеВСписке;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОграничениеТипа()
	
	Элементы.СписокЗначенийЗначение.ОграничениеТипа		 = Объект.ТипЗначения;
	Элементы.СписокЗначенийЗначение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
	Элементы.Значение.ОграничениеТипа	   = Объект.ТипЗначения;
	Элементы.Значение.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
	
КонецПроцедуры
